am_dau_map = {
    "/b-/": ["b"],
    "/m-/": ["m"],
    "/f-/": ["ph"],
    "/v-/": ["v"],
    "/t-/": ["t"],
    "/t'-/": ["th"],
    "/d-/": ["đ"],
    "/n-/": ["n"],
    "/z-/": ["d", "gi"],      # tách riêng
    "/ʐ-/": ["r"],
    "/s-/": ["x"],
    "/ʂ-/": ["s"],
    "/c-/": ["ch"],
    "/ʈ-/": ["tr"],
    "/ɲ-/": ["nh"],
    "/l-/": ["l"],
    "/k-/": ["k", "q", "c"],  # gom 3 chữ viết
    "/χ-/": ["kh"],
    "/ŋ-/": ["ngh", "ng"],
    "/ɣ-/": ["gh", "g"],
    "/h-/": ["h"],
    "/ʔ-/": [""]             # không thể hiện
}
am_dem_map = {
    "/-w-/": ["u", "o"],  
    "/zero/": [""]         # không thể hiện
}
am_chinh_map = {
    "/-i-/": ["y", "i"],
    "/-e-/": ["ê"],
    "/-ɛ-/": ["e"],
    "/-ɯ-/": ["ư"],
    "/-ɤ-/": ["ơ"],
    "/-a-/": ["a"],
    "/-u-/": ["u"],
    "/-o-/": ["ô", "ô"],   # ô hoặc ô (ít) – giữ cả 2 dạng
    "/-ɔ-/": ["o", "oo"],   # o hoặc oo (ít)
    "/-ɤ̆-/": ["â"],
    "/-ɛ̆-/": ["a"], # Nếu vần là -anh, -ach
    "/-ă-/": ["a"], # (+ âm cuối /-w/, /-j/)
    "/-ă-/": ["ă"],
    "/-ɔ̆-/": ["o"],
    "/-ie-/": ["iê", "yê", "ia", "ya"],   # iê/yê/ia/ya
    "/-ɯɤ-/": ["ươ", "ưa"],
    "/-uo-/": ["uô", "ua"]
}
am_cuoi_map = {
    "/-m/": ["m"],
    "/-n/": ["n"],
    "/-p/": ["p"],
    "/-t/": ["t"],
    "/-ŋ/": ["nh", "ng"],  # nh (sau i, ê, e) và ng (còn lại)
    "/-k/": ["ch", "c"],   # ch (sau i, ê, e) và c (còn lại)
    "/-w/": ["o", "u"],    # o (sau a, ă, e) và u (còn lại)
    "/-j/": ["y", "i"],    # y (sau a, ă, i) và i (còn lại)
    "/zero/": [""]         # không thể hiện
}


# ==== Helpers: Unicode & thanh điệu ====

TONE_DIACRITIC_TO_NUM = {
    "\u0301": "5",  # acute  (sắc)
    "\u0300": "2",  # grave  (huyền)
    "\u0303": "3",  # tilde  (ngã)
    "\u0309": "4",  # hook   (hỏi)
    "\u0323": "6",  # dot    (nặng)
}
TONE_NUM_DEFAULT = "1"

